# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\psoc\chamonix\camera_boot\camera_boot.cydsn\camera_boot.cyprj
# Date: Thu, 18 Oct 2018 17:56:46 GMT
#set_units -time ns
create_clock -name {I2C_1_SCBCLK(FFB)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2C_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]


# Component constraints for C:\psoc\chamonix\camera_boot\camera_boot.cydsn\TopDesign\TopDesign.cysch
# Project: C:\psoc\chamonix\camera_boot\camera_boot.cydsn\camera_boot.cyprj
# Date: Thu, 18 Oct 2018 17:56:43 GMT
